Validation Notes:

DV - 12/7/15:
Channel stats for Applause_-_enthusiastic2.wav
env stats do not match yet

ipdb> stats
<__main__.Compute object at 0x1116ae9d0>
ipdb> stats.mean
array([ -1.30969704e-06,  -1.16261322e-22,  -3.01543729e-22,
         3.65337411e-22,  -1.41604548e-21,  -1.07068595e-21,
        -5.07929357e-22,  -4.18966697e-22,  -2.16066004e-21,
        -1.94381961e-22,   1.46831951e-21,   1.11905153e-21,
        -4.25936568e-23,  -4.97571354e-22,  -9.49451331e-22,
         3.29907232e-21,  -1.81061763e-21,  -1.13299127e-21,
         3.45395835e-21,  -3.06364557e-21,  -1.46173686e-23,
         3.76760255e-22,  -2.09870563e-22,  -3.44427797e-22,
        -1.24707451e-22,  -6.38904852e-23,   1.17132556e-23,
         7.37644692e-23,  -3.11708125e-23,  -1.56822100e-23,
         3.02027748e-23,   8.08311441e-24])
ipdb> stats.var
array([  3.95182906e-11,   1.50977381e-09,   9.45690742e-09,
         2.12290677e-08,   9.26195467e-08,   1.15427986e-07,
         1.17981835e-07,   2.03875191e-07,   5.60816104e-07,
         7.52896460e-07,   1.17999787e-06,   1.47671530e-06,
         2.23289656e-06,   2.84012624e-06,   5.26837131e-06,
         6.12002313e-06,   1.16847229e-05,   2.61101964e-05,
         2.51490442e-05,   1.00588530e-05,   3.30616303e-06,
         1.40986411e-06,   7.65494029e-07,   3.16956373e-07,
         1.03005467e-07,   4.50580883e-08,   2.58772869e-08,
         1.61548703e-08,   9.29650373e-09,   4.34839296e-09,
         9.21710128e-10,   5.90189387e-11])
ipdb> stats.skew
array([ -1.16951160e+00,  -9.81314879e-03,   2.21020794e-03,
         7.44301456e-17,   1.18717958e-17,   2.42661179e-17,
         2.85261395e-17,  -3.25813249e-17,   1.87321078e-17,
         5.25088413e-17,   4.18164857e-18,  -2.72987772e-17,
        -6.54199761e-19,  -1.87027450e-18,   2.82336936e-17,
        -1.25957033e-17,  -1.45642820e-17,  -1.89769146e-17,
         1.25738477e-17,   6.04069590e-18,   4.52448875e-18,
        -5.87601594e-17,  -9.27603596e-19,  -8.27382002e-18,
        -1.28044317e-17,  -1.31059347e-17,  -8.88316185e-18,
        -5.14370254e-04,   5.21075487e-02,   1.32405209e-17,
         3.18830990e-17,  -5.76638035e-17])
ipdb> stats.kurtosis
array([ 14.56688806,   9.36733092,  11.43817068,   7.65416521,
         4.57632316,   7.00206917,   5.37481864,   5.18342024,
         5.404937  ,   5.62856344,   6.11984409,   5.17999677,
         5.69113198,   4.79669306,   5.83104741,   5.1154509 ,
         5.5664963 ,   7.85963205,   7.567916  ,  10.46965742,
        11.0097242 ,  14.89786831,  11.1742925 ,   7.18876818,
         9.60133818,   9.94339808,  12.63729576,  12.82112886,
        10.38495037,   9.47108058,  13.22965175,  17.29129026])
ipdb> stats.auto_c
array([], dtype=float64)
ipdb> stats.auto_c_power
array([], dtype=float64)
ipdb> stats.auto_c.shape
(0,)

ipdb> self.e_mean
array([ 0.02614025,  0.04267683,  0.05476092,  0.06906113,  0.08883534,
        0.09176619,  0.09242238,  0.09897199,  0.11408282,  0.11967726,
        0.1258666 ,  0.13118533,  0.13998763,  0.14590156,  0.15821871,
        0.16274977,  0.17876133,  0.19491861,  0.1940673 ,  0.16755494,
        0.1413461 ,  0.12396803,  0.11522856,  0.10298397,  0.08597134,
        0.07493973,  0.06821283,  0.06318478,  0.05890355,  0.05249526,
        0.04119119,  0.02741345])

ipdb> self.e_var
array([ 0.24352515,  0.31307946,  0.31830113,  0.23028561,  0.21655712,
        0.20796782,  0.20341257,  0.22158427,  0.23301255,  0.22965384,
        0.22824201,  0.22503176,  0.23140968,  0.23188017,  0.24129857,
        0.23218147,  0.23415399,  0.2604119 ,  0.2594532 ,  0.25095808,
        0.2510487 ,  0.24158295,  0.22610774,  0.20962126,  0.21482566,
        0.22617724,  0.22563994,  0.23001143,  0.21965447,  0.22368943,
        0.22334497,  0.20590285])

ipdb> self.e_skew
array([ 0.1785523 ,  0.527904  ,  0.81422586,  0.2750203 , -0.09727636,
        0.05087974,  0.08658518, -0.00430935,  0.06536934,  0.08783362,
        0.20095011,  0.08405314,  0.14252119,  0.03705271,  0.1615192 ,
        0.08615916,  0.15389297,  0.42396478,  0.39841947,  0.68953609,
        0.56230653,  0.61730367,  0.4674881 ,  0.34854526,  0.46621301,
        0.4805081 ,  0.56379345,  0.51274964,  0.33508369,  0.33870706,
        0.55505494,  0.96700289])

ipdb> self.e_kurtosis
array([ 2.72995355,  2.68997625,  3.31646901,  3.34179831,  2.77515772,
        3.50266716,  3.02519925,  2.96340704,  2.79596695,  2.78273067,
        2.87407634,  2.74368546,  2.7545141 ,  2.56673953,  2.67378845,
        2.63898647,  2.72097523,  2.96799351,  2.86772577,  3.68625104,
        3.52800186,  3.78691156,  3.4902205 ,  3.13202286,  3.25478005,
        3.21715178,  3.5210153 ,  3.39456395,  2.89355452,  2.88818451,
        3.24462878,  4.3040051 ])

ipdb> self.e_auto_c
array([[ 0.8146109 ,  0.66801121,  0.54736814,  0.45796959,  0.37656066,
         0.29398147,  0.21953077,  0.12172628,  0.03852047, -0.05253141,
        -0.04771193, -0.00621107, -0.00913616,  0.1738611 ,  0.293755  ,
         0.01400417,  0.11259014,  0.14148836,  0.18067435,  0.01811041,
         0.09669243,  0.12822835,  0.1012913 ],
       [ 0.91643376,  0.76645717,  0.60519957,  0.45828636,  0.33557262,
         0.23869965,  0.16631424,  0.07136899,  0.01372937, -0.02044689,
        -0.06140832, -0.00840732, -0.16234784,  0.06610711,  0.38230681,
         0.00787198,  0.02976667,  0.26008921,  0.02399695,  0.1491868 ,
         0.07104041,  0.12539175,  0.21165839],
       [ 0.89221117,  0.71193262,  0.53033018,  0.37475846,  0.24984544,
         0.15577171,  0.08983451,  0.00761486, -0.02762869, -0.03448087,
        -0.04821526, -0.06210323, -0.09504115,  0.10407419,  0.3882003 ,
        -0.02980514, -0.07365053,  0.29197412,  0.11670815,  0.0658793 ,
         0.16578887,  0.24876038,  0.23391952],
       [ 0.7585268 ,  0.46625408,  0.26918769,  0.18346203,  0.16974731,
         0.17642786,  0.16432556,  0.07102238,  0.01457862,  0.0361114 ,
         0.02072854, -0.00647423,  0.06650884,  0.0917447 ,  0.16167348,
         0.04645641,  0.0406099 ,  0.15879797,  0.04985817,  0.17637413,
         0.22850497,  0.23516735,  0.19800045],
       [ 0.77030367,  0.48855033,  0.31334089,  0.23703259,  0.20266681,
         0.18516877,  0.16698806,  0.14696926,  0.13486662,  0.09510999,
         0.05667683,  0.06038357,  0.08163361,  0.176902  ,  0.18833186,
         0.1389877 ,  0.20946368,  0.15826671,  0.12593869,  0.16730958,
         0.15437489, -0.01265252, -0.20581638],
       [ 0.66653431,  0.37064993,  0.29272908,  0.28792952,  0.24800934,
         0.20259813,  0.2091741 ,  0.2549648 ,  0.23462718,  0.20905852,
         0.2073227 ,  0.19577539,  0.2188427 ,  0.20279593,  0.142015  ,
         0.11343975,  0.18128114,  0.19232312,  0.14284401,  0.06788682,
         0.0847508 ,  0.06900854,  0.06604616],
       [ 0.62009847,  0.32029953,  0.29337474,  0.28967518,  0.26358523,
         0.22886772,  0.22610524,  0.23845756,  0.18114416,  0.1855556 ,
         0.22721609,  0.1377196 ,  0.1457921 ,  0.14868047,  0.19946972,
         0.20437387,  0.17657261,  0.18636221,  0.12517005,  0.2449747 ,
         0.14717966,  0.12306505,  0.12302509],
       [ 0.60095168,  0.33635442,  0.29032769,  0.25409339,  0.23643651,
         0.22800742,  0.23035395,  0.21546986,  0.13635743,  0.10797874,
         0.08167178,  0.04164048,  0.0809776 ,  0.18021437,  0.27923597,
         0.21344765,  0.34754754,  0.24460752,  0.16092252,  0.30303847,
         0.2671184 ,  0.19698788,  0.10559584],
       [ 0.65412173,  0.4035603 ,  0.30884078,  0.24047524,  0.21186018,
         0.19054861,  0.18766448,  0.16914929,  0.1311868 ,  0.12264822,
        -0.01257012, -0.03583128, -0.0069718 ,  0.07769407,  0.22741543,
         0.20024195,  0.16796044,  0.24923672,  0.06411738,  0.30586089,
         0.16516062,  0.18020992,  0.15175453],
       [ 0.56318109,  0.36274465,  0.30904533,  0.27736882,  0.23504342,
         0.21557868,  0.20537932,  0.22789718,  0.14777423,  0.05080122,
        -0.01008843, -0.1001738 , -0.08133761,  0.05537965,  0.27880297,
         0.23911553,  0.10458155,  0.19528605,  0.00593625,  0.20088618,
         0.13956893,  0.07828036,  0.07585234],
       [ 0.52509703,  0.35359729,  0.29195422,  0.25354329,  0.20730903,
         0.19071889,  0.1771148 ,  0.20195798,  0.15632241,  0.16338723,
         0.16717702,  0.11303126,  0.12879375,  0.07499858,  0.18680225,
         0.23735778,  0.39152132,  0.17256   ,  0.18639141,  0.33517918,
         0.13486261,  0.24032213,  0.18426959],
       [ 0.44037196,  0.31564345,  0.29553995,  0.23316513,  0.24566114,
         0.21155809,  0.21997752,  0.16730408,  0.15070947,  0.14077967,
         0.12261578,  0.10803587,  0.09198776,  0.09776428,  0.26218178,
         0.24184084,  0.33315945,  0.24943599,  0.22727985,  0.3104018 ,
         0.17580663,  0.1209083 ,  0.16248834],
       [ 0.42376845,  0.31983474,  0.30456026,  0.29758677,  0.26068497,
         0.23769291,  0.20416734,  0.22009177,  0.18745713,  0.13691211,
         0.14925585,  0.11236528,  0.09772248,  0.22213943,  0.38599037,
         0.35185707,  0.31701379,  0.3369547 ,  0.25068706,  0.32189919,
         0.24148228,  0.20822358,  0.17769567],
       [ 0.39193976,  0.35342928,  0.3050178 ,  0.29402123,  0.2724865 ,
         0.25832012,  0.23510882,  0.21768788,  0.18688742,  0.18737639,
         0.10929522,  0.09240285,  0.14166739,  0.19250343,  0.35834817,
         0.4123164 ,  0.31615741,  0.29892761,  0.33663139,  0.33239457,
         0.24096299,  0.23813238,  0.20452915],
       [ 0.42361956,  0.38975289,  0.33934614,  0.27062167,  0.24770062,
         0.24564756,  0.22853697,  0.21645794,  0.20143365,  0.18704345,
         0.16666296,  0.10760654,  0.15028758,  0.16828614,  0.36107142,
         0.31309074,  0.32615536,  0.27213815,  0.29281462,  0.32457979,
         0.23729445,  0.23853666,  0.14922386],
       [ 0.35092842,  0.32808851,  0.27587844,  0.25941121,  0.2136538 ,
         0.20994623,  0.21986413,  0.21286655,  0.13032201,  0.17027441,
         0.13052181,  0.0789725 ,  0.09332662,  0.13893723,  0.41245845,
         0.31853039,  0.2531566 ,  0.31784266,  0.28411498,  0.30366652,
         0.23791822,  0.20823823,  0.14465006],
       [ 0.42392085,  0.39400786,  0.34486346,  0.31866527,  0.28738835,
         0.24231457,  0.23589681,  0.20842071,  0.1503409 ,  0.11994351,
         0.07809765,  0.05296085,  0.06343226,  0.15666038,  0.4262972 ,
         0.27898468,  0.23328606,  0.36617953,  0.20545465,  0.32803712,
         0.27540196,  0.2173492 ,  0.12351765],
       [ 0.45205952,  0.39418562,  0.32485779,  0.2664737 ,  0.2372836 ,
         0.21738469,  0.17182603,  0.21446661,  0.13902942,  0.12508332,
         0.11432025,  0.05863373,  0.07120852,  0.17783197,  0.36766365,
         0.26661762,  0.24695605,  0.34988709,  0.20942609,  0.29873751,
         0.25300941,  0.21727681,  0.11417053],
       [ 0.46434078,  0.45799363,  0.35252051,  0.28439783,  0.23776575,
         0.17668038,  0.16010967,  0.16347921,  0.1558131 ,  0.107032  ,
         0.05150258,  0.03359801,  0.01087916,  0.10372334,  0.32454821,
         0.22015188,  0.23192621,  0.27459895,  0.1806513 ,  0.23072353,
         0.16088163,  0.16882251,  0.10322713],
       [ 0.4201437 ,  0.40720323,  0.33981723,  0.23067347,  0.19852419,
         0.16266086,  0.15648481,  0.14695333,  0.11420145,  0.10682253,
         0.05746382,  0.04203342,  0.02324217,  0.09630013,  0.32521154,
         0.14875445,  0.1492843 ,  0.27637702,  0.21116013,  0.1531682 ,
         0.1762031 ,  0.1471518 ,  0.01080653],
       [ 0.48972457,  0.45858016,  0.38969973,  0.33781383,  0.29231313,
         0.25728658,  0.24000801,  0.21585697,  0.14355358,  0.12910802,
         0.07858236,  0.07644486,  0.09178889,  0.16875633,  0.29631501,
         0.20885097,  0.17349467,  0.25378489,  0.22538556,  0.29248463,
         0.20679585,  0.109261  ,  0.08243666],
       [ 0.45747742,  0.42986664,  0.36915438,  0.30150066,  0.27565115,
         0.24534724,  0.19574064,  0.16632119,  0.08166958,  0.09126001,
         0.05476429,  0.04806733,  0.02296552,  0.10091296,  0.32555777,
         0.22210888,  0.10656885,  0.25358093,  0.12363317,  0.32053921,
         0.19063621,  0.14742238,  0.15706001],
       [ 0.47951023,  0.442609  ,  0.38688605,  0.28636356,  0.25537429,
         0.21342059,  0.20000777,  0.15554155,  0.10978851,  0.05188624,
        -0.01252046, -0.06052344, -0.03257504,  0.05094717,  0.24957185,
         0.2531127 ,  0.06029048,  0.19869685,  0.01697454,  0.2891971 ,
         0.2164069 ,  0.06679361,  0.07532077],
       [ 0.46653813,  0.41527514,  0.35827511,  0.29167072,  0.25021803,
         0.21103796,  0.16829352,  0.1419262 ,  0.11521842,  0.07271648,
         0.0112895 , -0.04046596, -0.06757083,  0.04773215,  0.22817755,
         0.24478056,  0.08346746,  0.24607311,  0.04073479,  0.29461764,
         0.1813954 ,  0.09230765,  0.11937878],
       [ 0.49277862,  0.43763581,  0.38154221,  0.30559247,  0.26318155,
         0.21653158,  0.19397906,  0.17160715,  0.11702888,  0.07411577,
         0.05087204, -0.0140357 , -0.01007014,  0.03606748,  0.19756504,
         0.2607379 ,  0.13022461,  0.19725434,  0.15016271,  0.29526419,
         0.22481495,  0.11513662,  0.15940176],
       [ 0.510818  ,  0.43297506,  0.39121273,  0.32258127,  0.24487766,
         0.22162731,  0.19516661,  0.16816984,  0.1273883 ,  0.12088956,
         0.11958229,  0.03807435,  0.06744337,  0.12815273,  0.28308319,
         0.18625925,  0.17220017,  0.28889545,  0.21327361,  0.31856454,
         0.30717344,  0.14181092,  0.19909167],
       [ 0.55038107,  0.48794164,  0.41995679,  0.35520757,  0.28419345,
         0.23801039,  0.22291045,  0.21229098,  0.13500529,  0.09940948,
         0.1106976 ,  0.04766342,  0.06433042,  0.08321376,  0.30849707,
         0.14933431,  0.12807098,  0.29770386,  0.18015235,  0.26404324,
         0.28480781,  0.10267675,  0.17387695],
       [ 0.57363659,  0.51665214,  0.43937526,  0.36552835,  0.28366689,
         0.25566861,  0.22536306,  0.22940877,  0.16086977,  0.13712833,
         0.14849518,  0.06838566,  0.08260705,  0.0647944 ,  0.26009612,
         0.0632045 ,  0.10398659,  0.32459759,  0.15141938,  0.17356248,
         0.34299351,  0.12449453,  0.15282079],
       [ 0.56613867,  0.52033262,  0.46435247,  0.40232439,  0.33887515,
         0.30841982,  0.2855675 ,  0.27708394,  0.24119057,  0.20143741,
         0.16973598,  0.0863297 ,  0.07928277,  0.0220573 ,  0.13711533,
         0.04596449,  0.09415805,  0.2716111 ,  0.13510657,  0.1185085 ,
         0.32543063,  0.0687685 ,  0.14633222],
       [ 0.61291208,  0.56577476,  0.49290415,  0.43831144,  0.37811344,
         0.34767284,  0.31228774,  0.31660879,  0.26329316,  0.22570119,
         0.18973482,  0.130841  ,  0.11021216,  0.04667978,  0.12918237,
         0.01467392,  0.09679959,  0.31386063,  0.15069441,  0.12553988,
         0.35079127,  0.09900441,  0.13414239],
       [ 0.55401041,  0.52672791,  0.46714475,  0.36931046,  0.32918126,
         0.30807732,  0.27275716,  0.27370189,  0.21727971,  0.15965407,
         0.15002729,  0.13531992,  0.11807183,  0.08424278,  0.20542494,
         0.07583871,  0.15391544,  0.35772072,  0.21259512,  0.1713811 ,
         0.33971364,  0.14393218,  0.14381941],
       [ 0.43803362,  0.41549466,  0.3207929 ,  0.23320946,  0.18711121,
         0.17247378,  0.17798695,  0.17173394,  0.12996611,  0.08692511,
         0.06458211,  0.06677072,  0.08686312,  0.11699035,  0.34761348,
         0.12780328,  0.19493304,  0.36165012,  0.24602324,  0.26702277,
         0.28427147,  0.23536606,  0.18921667]])