Validation Notes:

DV - 12/7/15:
Channel stats for Applause_-_enthusiastic2.wav
env stats do not match yet

ipdb> stats
<__main__.Compute object at 0x1116ae9d0>
ipdb> stats.mean
array([ -1.30969704e-06,  -1.16261322e-22,  -3.01543729e-22,
         3.65337411e-22,  -1.41604548e-21,  -1.07068595e-21,
        -5.07929357e-22,  -4.18966697e-22,  -2.16066004e-21,
        -1.94381961e-22,   1.46831951e-21,   1.11905153e-21,
        -4.25936568e-23,  -4.97571354e-22,  -9.49451331e-22,
         3.29907232e-21,  -1.81061763e-21,  -1.13299127e-21,
         3.45395835e-21,  -3.06364557e-21,  -1.46173686e-23,
         3.76760255e-22,  -2.09870563e-22,  -3.44427797e-22,
        -1.24707451e-22,  -6.38904852e-23,   1.17132556e-23,
         7.37644692e-23,  -3.11708125e-23,  -1.56822100e-23,
         3.02027748e-23,   8.08311441e-24])
ipdb> stats.var
array([  3.95182906e-11,   1.50977381e-09,   9.45690742e-09,
         2.12290677e-08,   9.26195467e-08,   1.15427986e-07,
         1.17981835e-07,   2.03875191e-07,   5.60816104e-07,
         7.52896460e-07,   1.17999787e-06,   1.47671530e-06,
         2.23289656e-06,   2.84012624e-06,   5.26837131e-06,
         6.12002313e-06,   1.16847229e-05,   2.61101964e-05,
         2.51490442e-05,   1.00588530e-05,   3.30616303e-06,
         1.40986411e-06,   7.65494029e-07,   3.16956373e-07,
         1.03005467e-07,   4.50580883e-08,   2.58772869e-08,
         1.61548703e-08,   9.29650373e-09,   4.34839296e-09,
         9.21710128e-10,   5.90189387e-11])
ipdb> stats.skew
array([ -1.16951160e+00,  -9.81314879e-03,   2.21020794e-03,
         7.44301456e-17,   1.18717958e-17,   2.42661179e-17,
         2.85261395e-17,  -3.25813249e-17,   1.87321078e-17,
         5.25088413e-17,   4.18164857e-18,  -2.72987772e-17,
        -6.54199761e-19,  -1.87027450e-18,   2.82336936e-17,
        -1.25957033e-17,  -1.45642820e-17,  -1.89769146e-17,
         1.25738477e-17,   6.04069590e-18,   4.52448875e-18,
        -5.87601594e-17,  -9.27603596e-19,  -8.27382002e-18,
        -1.28044317e-17,  -1.31059347e-17,  -8.88316185e-18,
        -5.14370254e-04,   5.21075487e-02,   1.32405209e-17,
         3.18830990e-17,  -5.76638035e-17])
ipdb> stats.kurtosis
array([ 14.56688806,   9.36733092,  11.43817068,   7.65416521,
         4.57632316,   7.00206917,   5.37481864,   5.18342024,
         5.404937  ,   5.62856344,   6.11984409,   5.17999677,
         5.69113198,   4.79669306,   5.83104741,   5.1154509 ,
         5.5664963 ,   7.85963205,   7.567916  ,  10.46965742,
        11.0097242 ,  14.89786831,  11.1742925 ,   7.18876818,
         9.60133818,   9.94339808,  12.63729576,  12.82112886,
        10.38495037,   9.47108058,  13.22965175,  17.29129026])
ipdb> stats.auto_c
array([], dtype=float64)
ipdb> stats.auto_c_power
array([], dtype=float64)
ipdb> stats.auto_c.shape
(0,)
ipdb> stats.e_mean
array([ 0.02288206,  0.03735747,  0.04793537,  0.06045315,  0.07776265,
        0.08032819,  0.08090259,  0.08663584,  0.09986321,  0.10476035,
        0.11017823,  0.11483401,  0.12253917,  0.12771597,  0.13849787,
        0.14246417,  0.15648001,  0.17062339,  0.16987819,  0.14667042,
        0.12372832,  0.1085163 ,  0.10086614,  0.09014775,  0.07525563,
        0.06559903,  0.05971059,  0.05530925,  0.05156164,  0.0459521 ,
        0.036057  ,  0.02399656])